octave:23> diary on
octave:24> w = 0.1
w =  0.10000
octave:25> r1 = [0.1; 0; 0.8]
r1 =

   0.10000
   0.00000
   0.80000

octave:26> r2 = [0.8;1;0.1];
octave:27> d = r2-r1'
d =

   0.70000   0.80000   0.00000
   0.90000   1.00000   0.20000
   0.00000   0.10000  -0.70000

octave:28> d = d/norm(d);
octave:29> sqrt((d(2)*(r1(3)-z)-d(3)*(r1(2)-Y)).^2 + ...
> (d(3)*(r1(1)-X)-d(1)*(r1(3)-Z)).^2+ ...
> (d(1)*(r1(2)-Y)-d(2)*r1(1)-X)).^2);
parse error:

  syntax error

>>> (d(1)*(r1(2)-Y)-d(2)*r1(1)-X)).^2);
                                     ^

octave:29> diary off
